
#20161124_莊于萱
# 時間：2016-11-17
# 主題：Classification 

#--------------------------------------------------------------------------------
# 一、最近鄰居法(KNN)
#--------------------------------------------------------------------------------

#--------------------------------------------------------------------------------
# 安裝套件
install.packages("class")
library(class)

# 抽樣
set.seed(1000)
set.seed(1234)
iris$Species = as.factor(iris$Species)
n=0.1*nrow(iris)
test.index=sample(1:nrow(iris),n)
iris.train=iris[-test.index,]
iris.test=iris[test.index,]

# KNN
r3 <- knn(iris.train[,-5],iris.test[,-5],iris.train[,5],k=3 );r3
(t3 = table(real = iris.test$Species, predicted = r3))

#--------------------------------------------------------------------------------
cat('Correct Classification Rate = ',100*sum(diag(t3))/sum(t3),' % \n')

#--------------------------------------------------------------------------------


#--------------------------------------------------------------------------------
# 【練習】KNN 美國網路借貸
#--------------------------------------------------------------------------------
# 資料型態(36)
# 依據過往的數據，預測新的會員是否信用良好
# FICO Score，美國借款人信用評等分數
# DTI，債務占收入比重
#----------------------------------------------------------------------------------------


#--------------------------------------------------------------------------------
# 安裝套件(37)
#--------------------------------------------------------------------------------
install.packages("dplyr")
install.packages("gmodels")
library(dplyr)
library(gmodels)
loan <- read.csv("data/Loan3.csv")
#----------------------------------------------------------------------------------------



#----------------------------------------------------------------------------------------
# 資料清理
#----------------------------------------------------------------------------------------
# 信用良好(good)、信用不佳(bad)
#----------------------------------------------------------------------------------------
loan$good <- ifelse(loan$loan_status == "Current" | 
                      loan$loan_status == "Fully Paid" |
                      loan$loan_status == "Does not meet the credit policy.  Status:Fully Paid",
                    "good","bad") #把此三種情況分為信用良好

table(loan$good)

# “good” =  “Current” ,“Fully Paid”
# "bad" = "Does not meet the credit policy.  Status:Fully Paid"
#----------------------------------------------------------------------------------------



#----------------------------------------------------------------------------------------
# 計算信用評分
#----------------------------------------------------------------------------------------
loan$fico <- (loan$fico_range_high + loan$fico_range_low)/2
is.factor(loan$fico_range_low)
#----------------------------------------------------------------------------------------
# 將數據標準化
normalize <- function(x) {
  return ((x - min(x)) / (max(x) - min(x)))
}
#----------------------------------------------------------------------------------------



#----------------------------------------------------------------------------------------
# 【極值正規化】信用評分(fico)、債務占收入比(dti)
#----------------------------------------------------------------------------------------
loan$fico_n <- normalize(loan$fico)
loan$dti_n <- normalize(loan$dti)
loan$loan_amnt_n <- normalize(loan$loan_amnt)
summary(loan[,c("dti_n", "fico_n", "loan_amnt_n")])
summary(loan[,c("fico", "fico_n")])
#----------------------------------------------------------------------------------------



#----------------------------------------------------------------------------------------
# Step 1.抽樣 
set.seed(364)

# 取80%為訓練資料，20%測試資料
sample <- sample(nrow(loan),floor(nrow(loan)*0.8))
train <- loan[sample,]
test <- loan[-sample,]
#----------------------------------------------------------------------------------------
length(sample)

#--------------------------------------------------------------------------------
# Step 2.KNN (42)
#--------------------------------------------------------------------------------
# 利用select取出特定欄位資料 train, fico_n, dti_n, loan_amnt_n，存入train_knn
# 利用select取出特定欄位資料 test, fico_n, dti_n, loan_amnt_n，存入train_knn

train_knn <- select(train,fico_n,dti_n,loan_amnt_n)  
test_knn <- select(test,fico_n,dti_n,loan_amnt_n)
# loan_amnt 貸款額度
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# Step3.預測
# 設定k=5，進行預測
pred <- knn(train_knn,test_knn,train$good,k=5)
real <- test$good

# 準確度
x <- CrossTable(x=real, y=pred, prop.chisq=FALSE,prop.c = FALSE,prop.r = FALSE)
# 卡方/列百分比、行百分比
x$t
cat('Correct Classification Rate = ',100*sum(diag(x$t))/sum(x$t),' % \n')


#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# 二、簡單貝氏法
#--------------------------------------------------------------------------------
install.packages("e1071")
library(e1071)
#--------------------------------------------------------------------------------
# Step 1.抽樣
set.seed(1223)
iris$Species = as.factor(iris$Species)

n=0.2*nrow(iris)
test.index=sample(1:nrow(iris),n)

iris.train=iris[-test.index]
iris.test=iris[test.index]

#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# Step 2. 貝氏
m2 <- naiveBayes(Species ~ . ,data = iris.train)

# Step 3. 預測
r2 <- predict( m2,iris.test[,-5], type = "class" )
(t = table(real = iris.test$Species, predicted = r2))

cat('Correct Classification Rate = ',100*sum(diag(t))/sum(t),' % \n')
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# 【練習】Naive Bayes_Titanic (24)
#--------------------------------------------------------------------------------
data(Titanic)
str(Titanic)
is.data.frame(Titanic)
is.table(Titanic)
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# 資料轉換
# 將table 轉換成data.frame
countsToCases <- function(x, countcol = "Freq") {
  idx <- rep.int(seq_len(nrow(x)), x[[countcol]])
  x[[countcol]] <- NULL
  x[idx, ]
}
#--------------------------------------------------------------------------------
Titanic <- countsToCases(as.data.frame(Titanic))
head(Titanic)
nrow(Titanic)


#--------------------------------------------------------------------------------
# Step 1.抽樣
set.seed(1223)
# 20%為測試資料

n=ceiling(0.2*nrow(Titanic))
test.index=sample(1:nrow(Titanic),n)

Titanic.train=Titanic[-test.index,]
Titanic.test=Titanic[test.index,]
head(Titanic.train)


#--------------------------------------------------------------------------------
# 貝氏
model <- naiveBayes(Survived ~ . ,data = Titanic.train);model
#--------------------------------------------------------------------------------


#--------------------------------------------------------------------------------
# 預測
pred <- predict(model,Titanic.test);head(pred,10)
pred1 <- predict(model,Titanic.test,type = "raw");head(pred1,10)    # 後驗機率

r3 <- predict( model,Titanic.test[,-4], type = "class" )
(t3 = table(real = Titanic.test$Survived, predicted = r3))
cat('Correct Classification Rate = ',100*sum(diag(t3))/sum(t3),' % \n')
#--------------------------------------------------------------------------------



#---------------------------------------------------------------------------------------
# 三、綜合練習
#---------------------------------------------------------------------------------------

library(rpart)
library(e1071)

#---------------------------------------------------------------------------------------
# 【練習】Credit
#---------------------------------------------------------------------------------------
credit <- read.csv("data/credit2.csv")
str(credit)
#---------------------------------------------------------------------------------------


# 資料整理
#---------------------------------------------------------------------------------------
credit$default <- ifelse( credit$default  == 1,"no","yes")
credit$default<- factor(credit$default)
table(credit$default)                     # no=1,yes=2
#---------------------------------------------------------------------------------------



#---------------------------------------------------------------------------------------
# 抽樣 (46)
set.seed(1223)
credit <- credit[order(runif(1000)), ]
#---------------------------------------------------------------------------------------




#---------------------------------------------------------------------------------------
# 抽樣
#---------------------------------------------------------------------------------------
n=ceiling(0.1*nrow(credit))
test.index=sample(1:nrow(credit),n)
credit.train=credit[-test.index,]
credit.test=credit[test.index,]
#---------------------------------------------------------------------------------------
head(credit.train)
summary(credit.test)
#---------------------------------------------------------------------------------------





#---------------------------------------------------------------------------------------
# KNN
#---------------------------------------------------------------------------------------
# 設定=10
pred1 <- knn(credit.train[,-8],credit.test[,-8],credit.train[,8],k=10);pred1
(t1 = table(real = credit.test$default, predicted = pred1))
knn <- sprintf("%.0f%%", sum(diag(t1))/sum(t1) * 100);knn
#---------------------------------------------------------------------------------------





#---------------------------------------------------------------------------------------
# 貝氏
#---------------------------------------------------------------------------------------
model2 <- naiveBayes(default ~ . ,data = credit.train)
pred2 <- predict(model2,credit.test[,-8],type = "class")
(t2 = table(real = credit.test$default, predicted = pred2))
naiveBayes <- sprintf("%.0f%%", sum(diag(t2))/sum(t2) * 100);naiveBayes
#---------------------------------------------------------------------------------------
#cat('Correct Classification Rate = ',100*sum(diag(t4))/sum(t4),' % \n')






#---------------------------------------------------------------------------------------
# 決策樹
#---------------------------------------------------------------------------------------
model3 <- rpart(default~.,data = credit.train)
pred3 <- predict(model3,credit.test[,-8],type = "class")
(t3 = table(real = credit.test$default, predicted = pred3))
DecisionTree <- sprintf("%.0f%%", sum(diag(t3))/sum(t3) * 100);DecisionTree
#---------------------------------------------------------------------------------------
(credit.classification <- data.frame(knn,naiveBayes,DecisionTree))




