
# 時間：2016-11-17
# 主題：Classification 

#--------------------------------------------------------------------------------
# 決策樹 
#--------------------------------------------------------------------------------
# 安裝套件
install.packages("rpart")
install.packages("rpart.plot")
library(rpart)
library(rpart.plot)
 #--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# Step 1 抽樣
set.seed(1234)
iris$Species = as.factor(iris$Species)
#--------------------------------------------------------------------------------
n=0.1*nrow(iris)
test.index=sample(1:nrow(iris),n)                           
#--------------------------------------------------------------------------------
iris.train=iris[-test.index,]
iris.test=iris[test.index,]
head(iris.train,4)
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# Step 2 決策樹
m1=rpart(Species~.,data=iris.train)
rpart.plot(m1, type= 1,extra=2)
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# Step 3 預測
pred1 <- predict(m1,iris.test[,1:4], type = "class" )
(t1 = table(real = iris.test$Species, predict = pred1))
head(iris[,1:5],5)
# 正確率
cat('Correct Classification Rate = ',100*sum(diag(t1))/sum(t1),' % \n')

# 計算預測準確率 = 對角線的數量/總數量
#--------------------------------------------------------------------------------

x=1


#--------------------------------------------------------------------------------
# 【練習】決策樹 鐵達尼克
#--------------------------------------------------------------------------------
# 資料讀取
titanic <- read.table("data/titanic.data", header=F)

# 將欄位重新命名"Class", "Age", "Sex", "Survived"
names(titanic) <- c("Class","Age","Sex","Survived")
head(titanic)


#--------------------------------------------------------------------------------
# Step 1 抽樣
set.seed(1234)                           # 設定隨機抽樣的起始點
ceiling(0.5)
n=round(0.5*nrow(titanic))
test.index = sample(1:nrow(titanic),n)
titanic.train = titanic[-test.index,]
titanic.test = titanic[test.index,]
#--------------------------------------------------------------------------------
# Step 2 決策樹
titanic.model = rpart(Survived~.,data = titanic.train)
rpart.plot(titanic.model,type=1,extra = 8)



#--------------------------------------------------------------------------------
# Step 3 預測
pred2 = predict(titanic.model,titanic.test[,1:4],type = "class")
(t2 = table(real = titanic.test$Survived,predict = pred2))
cat("預測準確率:",100*sum(diag(t2))/sum(t2),"%\n")
# 預測準確率 = 對角線的數量/總數量
# ?  % 
#--------------------------------------------------------------------------------


